# PT on Pandas

In [1]:
# pandas series and Pandas DataFrame

# Both the pandas series and the pandas dataframe are built based on the numpy arrays.
# The pandas series is a one dimensional array. 

import numpy as np
import pandas as pd
age = np.array([1,2,3,4,5]) 
ages = pd.DataFrame(age) # In this case, pandas will display a single line with values ranging from 0 on the index and colums
print(ages)

   0
0  1
1  2
2  3
3  4
4  5

In [2]:
pd.__version__ # To check the version of pandas install in your system

'1.5.3'

In [3]:
s1 = pd.Series() # To check a pandas series function.

C:\Users\ACER\AppData\Local\Temp\ipykernel_12100\3561579690.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s1 = pd.Series() # To check a pandas series function.

In [4]:
s1 # s1 will display an empty list and the dtype since no parameter is passed into it.

Series([], dtype: float64)

In [5]:
s2 = pd.Series([1,2,3,4,5]) # parameters are passed into s2 and hence it will display index and values.
s2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
s2.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
s2.values

array([1, 2, 3, 4, 5], dtype=int64)

In [8]:
# Sometimes we might assigned variables of our choice to the index as can be shown below.
s3 = pd.Series([1,2,3,4,5], index = [10,20,30,40,50])
s3

10    1
20    2
30    3
40    4
50    5
dtype: int64

In [9]:
scores = pd.Series([5.2, 3.2,4.2,2.2,6.2], index = ["Bob", "Jon", "Kai", "Tim", "Jay"])
scores

Bob    5.2
Jon    3.2
Kai    4.2
Tim    2.2
Jay    6.2
dtype: float64

In [10]:
scores.index

Index(['Bob', 'Jon', 'Kai', 'Tim', 'Jay'], dtype='object')

In [11]:
scores.values

array([5.2, 3.2, 4.2, 2.2, 6.2])

In [12]:
# Also dictionary can be used to passed in both the indexes and the values. For example:

d = {"Bob": 5.2, "Jon": 3.2, "Kai": 4.2, "Tim":2.2, "Jay":6.2}

s4 = pd.Series(d)
s4

Bob    5.2
Jon    3.2
Kai    4.2
Tim    2.2
Jay    6.2
dtype: float64

In [13]:
# Pandas - DataFrame. 
# To create a pandas dataframe constructor we do the following:

df1 = pd.DataFrame() # As python is case sensitive, the letter (d) and (f) are upper cases.

In [14]:
type(df1)

pandas.core.frame.DataFrame

In [15]:
print(df1) # This shows it is a pandas dataframe with an empty column and index list

Empty DataFrame
Columns: []
Index: []

In [16]:
df1 = [["John", 'Doe', 23, "Chemistry", 4.32],
      ['Peter', 'Pan', 24, 'Computer Science', 4.60],
      ["Charlse", "Micheal", 25, "Mathematics", 3.88],
      ["Favour", 'Ewe', 22, "Microbiology", 4.22],
      ['Miracle', 'James', 26, "Biochemistry", 4.90]]
s5 = pd.DataFrame(df1)
s5

         0        1   2                 3     4
0     John      Doe  23         Chemistry  4.32
1    Peter      Pan  24  Computer Science  4.60
2  Charlse  Micheal  25       Mathematics  3.88
3   Favour      Ewe  22      Microbiology  4.22
4  Miracle    James  26      Biochemistry  4.90

In [17]:
s5 = pd.DataFrame(df1, columns = ["Firstname", "Lastname","Age", "Department", "CGPA"])

In [18]:
s5

  Firstname Lastname  Age        Department  CGPA
0      John      Doe   23         Chemistry  4.32
1     Peter      Pan   24  Computer Science  4.60
2   Charlse  Micheal   25       Mathematics  3.88
3    Favour      Ewe   22      Microbiology  4.22
4   Miracle    James   26      Biochemistry  4.90

In [19]:
s5 = pd.DataFrame(df1, index = ["i", "ii", "iii", "iv", "v"])

In [20]:
s5

           0        1   2                 3     4
i       John      Doe  23         Chemistry  4.32
ii     Peter      Pan  24  Computer Science  4.60
iii  Charlse  Micheal  25       Mathematics  3.88
iv    Favour      Ewe  22      Microbiology  4.22
v    Miracle    James  26      Biochemistry  4.90

In [52]:
# To pass in dictionary into the dataframe we dont need to put the columns and index as the dictionary keys does that. E.g

students_dict = {"First_name":['John', 'Peter', "charlse", "Favour", "Miracle"],
                "Last_name":['Doe', 'Pan', "Micheal", "Ewe", 'James'],
                "Age":[23,24,25,22,26],
                "Department":["Chemistry", "Computer Science", "Mathematics", "Microbiology", 'Biochemistry'],
                "CGPA":[4.32,4.60,3.88,4.22,4.90],
                "Gender":['male', 'male','male','female','female']}

In [53]:
students_data = pd.DataFrame(students_dict)
students_data

  First_name Last_name  Age        Department  CGPA  Gender
0       John       Doe   23         Chemistry  4.32    male
1      Peter       Pan   24  Computer Science  4.60    male
2    charlse   Micheal   25       Mathematics  3.88    male
3     Favour       Ewe   22      Microbiology  4.22  female
4    Miracle     James   26      Biochemistry  4.90  female

In [54]:
index_change = pd.DataFrame(students_dict, index = ["a)", "b)", "c)", "d)", "e)"])
index_change

   First_name Last_name  Age        Department  CGPA  Gender
a)       John       Doe   23         Chemistry  4.32    male
b)      Peter       Pan   24  Computer Science  4.60    male
c)    charlse   Micheal   25       Mathematics  3.88    male
d)     Favour       Ewe   22      Microbiology  4.22  female
e)    Miracle     James   26      Biochemistry  4.90  female

In [55]:
df2 = pd.DataFrame(students_data, columns = ["Last_name", "CGPA"]) # This helps to show your data based on the column assigned
df2

  Last_name  CGPA
0       Doe  4.32
1       Pan  4.60
2   Micheal  3.88
3       Ewe  4.22
4     James  4.90

In [56]:
df3 = pd.DataFrame(students_data, columns = ["First_name", "Department"])
df3

  First_name        Department
0       John         Chemistry
1      Peter  Computer Science
2    charlse       Mathematics
3     Favour      Microbiology
4    Miracle      Biochemistry

In [57]:
students_data.shape # To check the shape of your dataset

(5, 6)

In [58]:
students_data.head(1) # This command displays the first row of your dataset

  First_name Last_name  Age Department  CGPA Gender
0       John       Doe   23  Chemistry  4.32   male

In [59]:
students_data.head(3)

  First_name Last_name  Age        Department  CGPA Gender
0       John       Doe   23         Chemistry  4.32   male
1      Peter       Pan   24  Computer Science  4.60   male
2    charlse   Micheal   25       Mathematics  3.88   male

In [60]:
students_data.tail(1) # This displays the last row of your dataset.

  First_name Last_name  Age    Department  CGPA  Gender
4    Miracle     James   26  Biochemistry   4.9  female

In [61]:
students_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First_name  5 non-null      object
 1   Last_name   5 non-null      object
 2   Age         5 non-null      int64
 3   Department  5 non-null      object
 4   CGPA        5 non-null      float64
 5   Gender      5 non-null      object
dtypes: float64(1), int64(1), object(4)
memory usage: 372.0+ bytes

In [62]:
students_data.describe()

             Age      CGPA
count   5.000000  5.000000
mean   24.000000  4.384000
std     1.581139  0.386626
min    22.000000  3.880000
25%    23.000000  4.220000
50%    24.000000  4.320000
75%    25.000000  4.600000
max    26.000000  4.900000

In [63]:
students_data.min()

First_name          Favour
Last_name              Doe
Age                     22
Department    Biochemistry
CGPA                  3.88
Gender              female
dtype: object

In [33]:
# How to read csv file using pandas.

In [36]:
df = pd.read_csv(r'C:\Users\ACER\Desktop\country-data.csv') # I am able to retrieve this document from my desktop by copying the
# path to this file. I went to my desktop, right clicked, went to the properties and copy the location.

In [37]:
df

,country,child_mort,exports,health,imports,income,inflation,life_expec,total_fer,gdpp
0,Afghanistan,90.2,10.0,7.58,44.9,1610,9.44,56.2,5.82,553
1,Albania,16.6,28.0,6.55,48.6,9930,4.49,76.3,1.65,4090
2,Algeria,27.3,38.4,4.17,31.4,12900,16.10,76.5,2.89,4460
3,Angola,119.0,62.3,2.85,42.9,5900,22.40,60.1,6.16,3530
4,Antigua and Barbuda,10.3,45.5,6.03,58.9,19100,1.44,76.8,2.13,12200
...,...,...,...,...,...,...,...,...,...,...
162,Vanuatu,29.2,46.6,5.25,52.7,2950,2.62,63.0,3.50,2970
163,Venezuela,17.1,28.5,4.91,17.6,16500,45.90,75.4,2.47,13500
164,Vietnam,23.3,72.0,6.84,80.2,4490,12.10,73.1,1.95,1310
165,Yemen,56.3,30.0,5.18,34.4,4480,23.60,67.5,4.67,1310
166,Zambia,83.1,37.0,5.89,30.9,3280,14.00,52.0,5.40,1460

In [38]:
df.shape # This is to check the shape and size of the file.

(167, 10)

In [39]:
df.columns # This will display the columns of the file.

Index(['country', 'child_mort', 'exports', 'health', 'imports', 'income',
       'inflation', 'life_expec', 'total_fer', 'gdpp'],
      dtype='object')

In [42]:
df.index # This will as well help us to see the indexes

RangeIndex(start=0, stop=167, step=1)

In [69]:
students_data

  First_name Last_name  Age        Department  CGPA  Gender
0       John       Doe   23         Chemistry  4.32     NaN
1      Peter       Pan   24  Computer Science  4.60     NaN
2    charlse   Micheal   25       Mathematics  3.88     NaN
3     Favour       Ewe   22      Microbiology  4.22     NaN
4    Miracle     James   26      Biochemistry  4.90     NaN

In [70]:
import random

In [75]:
students_data['Grade'] = pd.Series(random.choices(['First_Class','Second_class'],k=5))

In [76]:
students_data

  First_name Last_name  Age        Department  CGPA  Gender         Grade
0       John       Doe   23         Chemistry  4.32     NaN  Second_class
1      Peter       Pan   24  Computer Science  4.60     NaN   First_Class
2    charlse   Micheal   25       Mathematics  3.88     NaN  Second_class
3     Favour       Ewe   22      Microbiology  4.22     NaN  Second_class
4    Miracle     James   26      Biochemistry  4.90     NaN  Second_class

In [77]:
students_data.Gender

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: Gender, dtype: float64

In [80]:
df['Gender'] = df['Gender'].fillna()

KeyError: 'Gender'